Это задачи для собственной практики, задание для отчета находится в папке lab_report.

# Задача 1. Звездный треугольник.

Напишите функцию `drawTriangle(int side)`, печатающую на экран звездный прямоугольный треугольник с катетами, равными параметру side.

## Формат входных данных

На вход программе подается целое число `side`, передающееся в функцию `drawTriangle`. 

## Формат выходных данных

Программа должна вывести на экран звездный треугольник в соответствии с примером.

|Ввод|Вывод|
|:---:|---|
|3|\*<br>\*\*<br>\*\*\*|
|5|\*<br>\*\*<br>\*\*\*<br>\*\*\*\*<br>\*\*\*\*\*|

# Задача 2. Сумма цифр

Напишите функцию `coutDigitSum(int num)`, которая выводит на экран сумму цифр введенного числа.

## Формат входных данных

На вход программе подается целое число `num`, передающееся в фукнцию `coutDigitSum`. 

## Формат выходных данных

Программа должна вывести сумму цифр введенного числа.

|Ввод|Вывод|
|:---:|:---:|
|3|3|
|53|8|
|12345|15|

# Задача 3. Количество дней в месяце.

Напишите функцию `getDays(int month, int year)`, которая возвращает количество дней в месяце.

## Формат входных данных

На вход программе подается целое число `month` в диапазоне от 1 до 12, обозначающее номер месяца в году, а так же целое число `year`, обозначающее год

## Формат выходных данных

Программа должна вывести количество дней в введенном месяце

|Ввод|Вывод|
|:---:|:---:|
|1, 2000|31|
|2, 1900|28|
|2, 2000|29|
|12, 2023|31|

# Задача 4. Это простое число?

Напишите функцию `isPrime(int num)`, которая принимает в качестве аргумента натуральное число, которая возвращает булево значение, является ли число простым.

## Формат входных данных

На вход программе подается целое число `num`.

## Формат выходных данных

Программа должна вывести возвращенное функцией значение:  `true`, если число является простым, и `false` в противном случае.

|Ввод|Вывод|
|:--:|:--:|
|1|false|
|2|true|
|101|true|
|360000|false|

# Задача 5. Биномиальный коэффициент.

Напишите функцию `computeBinom(int n, int k)`, которая принимает в качестве аргументов два натуральных числа n и k и возвращает целое значение биномиального коэффициента, равного $$ \frac {n!}{k!(n-k)!} $$

Напишите дополнительную функцию `factorial(int n)`, вычисляющую факториал заданного числа.

## Формат входных данных

На вход программе подаются 2 целых числа `n` и `k`.

## Формат выходных данных

Программа должна вывести результат работы функции `computeBinom()` для введенных `n` и `k`. Результатом является целое число.

|Ввод|Вывод|
|:--:|:--:|
|1 <br> 1|1|
|2 <br> 1|2|s
|10 <br> 2|45|
|100 <br> 3|161700|

# Задача 6. Изменение на месте.

Напишите функцию `add(int num, int addend, bool onPlace)`, которая принимает 2 целых числа: первое и второе слагаемое, и булево значение, показывающее, необходимо изменить переменную `num` на месте или нет. Т.е. если значение `onPlace=true`, то переменная, переданная на место параметра `num`, должна быть изменена вне функции, иначе функция должна вернуть значение `num + addend`. 

```cpp
int n = 10;
add(n, 10, true);
cout << n; // 20

int m = 30;
int sum = add(m, 20, false);
cout << sum << ", " << m; // 50, 30
```