# Лабораторная работа №2 часть 2

## Циклы

В языке C++ имеются следующие виды циклов:

1. **for**
2. **while**
3. **do ... while**
   

### Синтаксис цикла for:
```cpp
for (инициализатор; условие; итерация)
{
    // тело цикла
}
```

- инициализатор выполняется один раз при начале выполнения цикла и представляет установку начальных условий, как правило, это инициализация счетчиков - специальных переменных, которые используются для контроля за циклом.
- условие представляет условие, при соблюдении которого выполняется цикл. Как правило, в качестве условия используется операция сравнения, и если она возвращает ненулевое значение (то есть условие истинно), то выполняется тело цикла, а затем выполняется итерация
- итерация выполняется после каждого завершения блока цикла и задает изменение параметров цикла. Обычно здесь происходит увеличение счетчиков цикла.

Пример:
```cpp
#include <iostream>
 
int main()
{   
    for(int i = 1; i < 10; i++)
    {
        std::cout << i << " * " << i << " = " << i * i << std::endl;
    }
}
```

### Синтаксис цикла while:

```cpp
while(условие)
{
    // тело цикла
}
```

После ключевого слова while в скобках идет условное выражение, которое возвращает true или false. Затем в фигурных скобках идет набор инструкций, которые составляют тело цикла. И пока условие возвращает true, будут выполняться инструкции в теле цикла.

Пример:

```cpp
#include <iostream>
 
int main()
{   
    int i = 1;
    while(i < 10)
    {
        std::cout << i << " * " << i << " = " << i * i << std::endl;
        i++;
    }
}
```

### Синтаксис цикла do ... while:
```cpp
do
{
    // тело цикла
}
while(условие);
```

Отличие от цикла while в том, что этот цикл является циклом с постусловием, в то время как цикл while является циклом с предусловием. Другими словами, цикл do ... while проверяет условие после первой итерации, т.е. выполнится как минимум один раз независимо от того, выполняется условие или нет. А цикл while сначала проверяет условие, а уже потом выполняет инструкции внутри.

### Бесконечный цикл

Для выполнения бесконечного цикла есть несколько способов:

```cpp
// for - опускаем иницализатор, условие и итерацию
for (;;)
{
    // тело цикла
}

// while - делаем условие всегда истинным
while(true) // или while(1), т.к. 1 = true
{
    // тело цикла
}


// do .. while
do
{
    // тело цикла
} while(true) // while(1)

```

Не забудьте поставить условие для выхода из бесконечного цикла, чтобы программа не зависла в нем. Это делается с помощью оператора break.

### Операторы break и continue

Для выхода из цикла используется оператор break. Допустим, мы не знаем, какое число будет на входе программе, но нам необходимо построить цикл до этого числа, но выйти из цикла, когда число будет равно 15.

```cpp
int n;
std::cin >> n;

for (int i = 0; i < n; i++)
{
    // операции
    if (i == 15)
    {
        std::cout << "i = 15, выходим из цикла";
        break;
    }
}
```

Оператор continue переходит к следующей итерации цикла. Допустим, в той же задаче нам нужно пропустить число 15, потому что с ним ничего не нужно делать.

```cpp
int n;
std::cin >> n;

for (int i = 0; i < n; i++)
{
    // операции
    if (i == 15)
    {
        std::cout << "i = 15, пропускаем итерацию";
        continue;
    }
    // операции, которые не произойдут, если число равно 15
    // но произойдут при других значениях i
}
```

# Задание: Значение функции на отрезке (по вариантам)

Необходимо найти значения функции на заданном промежутке.

### Формат входных данных

На вход программе подается два числа, определяющие отрезок, на котором необходимо найти значение функции.

## Формат выходных данных
Программа должна вывести значения функции, отделенные пробелом, на заданном промежутке в вещественных числах.

| Вариант | Функция | Отрезок |
| :-----: | :-----: | :-----: |
| 1, 11, 21 | $f(x) = 0.25x^2 + 0.75x + 1.5$| [-5; 5] |
| 2, 12, 22 | $f(x) = 0.75x^2 + 2.5x - 4$| [0; 15] |
| 3, 13, 23 | $f(x) = 8x^2  + 10x - 40$| [-3; 3] |
| 4, 14, 24 | $f(x) = 0.6x^2 + 0.9x + 1.2$| [0; 15] |
| 5, 15, 25 | $f(x) = -0.7x^2 - 0.6x + 2.3$| [-20; -5] |
| 6, 16, 26 | $f(x) = -7x^2 - 7x + 12$| [50; 70] |
| 7, 17, 27 | $f(x) = -2x^2 - 4x + 3$| [-3; 10] |
| 8, 18, 28 | $f(x) = x^3 + 30x - 100$| [-2; 8] |
| 9, 19, 29 | $f(x) = -0.7x^2 - 0.6x - 20$| [-8; 3] |
| 10, 20, 30 | $f(x) = 0.4x^2 + 0.2x - 0.5$| [-50; -30] |